{
  "consola-cli-unity": {
    "title": {
      "es": "Diseñando una consola CLI personalizada en Unity",
      "en": "Designing a custom CLI console in Unity",
      "pt-br": "Criando um console CLI personalizado no Unity"
    },
    "content": {
      "es": "<p>Exploramos la creación de una consola de comandos funcional con validaciones en tiempo real.</p><p>Se aborda el control del caret, protección del prompt y validaciones defensivas eficientes para ofrecer una experiencia profesional en tiempo de ejecución.</p>",
      "en": "<p>We explore the creation of a functional command console with real-time validations.</p><p>We cover caret control, prompt protection, and efficient defensive checks to offer a professional runtime experience.</p>",
      "pt-br": "<p>Exploramos a criação de um console de comandos funcional com validações em tempo real.</p><p>Abordamos o controle do cursor, proteção do prompt e verificações defensivas eficientes para garantir uma experiência profissional em tempo de execução.</p>"
    }
  },
  "eventos-con-actions": {
    "title": {
      "es": "Sistemas de eventos eficientes con Actions",
      "en": "Efficient event systems with Actions",
      "pt-br": "Sistemas de eventos eficientes com Actions"
    },
    "content": {
      "es": "<p>Conoce cuándo usar <code>Action</code> en lugar de <code>UnityEvent</code> y cómo diseñar eventos con máxima eficiencia.</p><p>Exploramos arquitectura desacoplada, performance y buenas prácticas en el uso de delegados en Unity.</p>",
      "en": "<p>Learn when to use <code>Action</code> instead of <code>UnityEvent</code> and how to design highly efficient events.</p><p>We explore decoupled architecture, performance, and best practices for using delegates in Unity.</p>",
      "pt-br": "<p>Descubra quando usar <code>Action</code> em vez de <code>UnityEvent</code> e como projetar eventos com eficiência máxima.</p><p>Exploramos arquitetura desacoplada, desempenho e boas práticas no uso de delegados no Unity.</p>"
    }
  },
  "eventos-globales-scriptableobjects": {
    "title": {
      "es": "ScriptableObjects para eventos globales",
      "en": "ScriptableObjects for global events",
      "pt-br": "ScriptableObjects para eventos globais"
    },
    "content": {
      "es": "<p>Arquitectura robusta usando <code>ScriptableObjects</code> para implementar eventos sin acoplamiento directo entre objetos.</p><p>Explora patrones basados en <code>Action</code>, suscripciones limpias y organización por canales centralizados.</p>",
      "en": "<p>Robust architecture using <code>ScriptableObjects</code> to implement events without direct coupling between objects.</p><p>Explore patterns based on <code>Action</code>, clean subscriptions, and centralized channel organization.</p>",
      "pt-br": "<p>Arquitetura robusta usando <code>ScriptableObjects</code> para implementar eventos sem acoplamento direto entre objetos.</p><p>Explore padrões baseados em <code>Action</code>, assinaturas limpas e organização por canais centralizados.</p>"
    }
  },
  "optimizar-assets-unity": {
    "title": {
      "es": "Cómo optimizar assets 3D en Unity",
      "en": "How to optimize 3D assets in Unity",
      "pt-br": "Como otimizar assets 3D no Unity"
    },
    "content": {
      "es": "<p>Este artículo explora técnicas para mejorar el rendimiento en tiempo real al trabajar con modelos 3D en Unity.</p><p>Hablaremos de draw calls, batching, LOD y cómo preparar assets correctamente.</p>",
      "en": "<p>This article explores techniques to improve real-time performance when working with 3D models in Unity.</p><p>We’ll cover draw calls, batching, LOD, and how to properly prepare your assets.</p>",
      "pt-br": "<p>Este artigo explora técnicas para melhorar o desempenho em tempo real ao trabalhar com modelos 3D no Unity.</p><p>Falaremos sobre draw calls, batching, LOD e como preparar corretamente os assets.</p>"
    }
  },
  "zenject-proyectos-pequenos": {
    "title": {
      "es": "Cómo usar Zenject en proyectos pequeños",
      "en": "Using Zenject in small projects",
      "pt-br": "Como usar Zenject em projetos pequenos"
    },
    "content": {
      "es": "<p>Este artículo explica cómo aprovechar Zenject incluso en arquitecturas modestas, sin caer en sobreingeniería innecesaria.</p>",
      "en": "<p>This article explains how to leverage Zenject even in modest architectures, without falling into unnecessary overengineering.</p>",
      "pt-br": "<p>Este artigo explica como aproveitar o Zenject mesmo em arquiteturas modestas, sem cair em sobreengenharia desnecessária.</p>"
    }
  }
}

